# Curve Overlap Point Class

Source: https://www.revitapidocs.com/2026/a81ce2d6-5a82-3d0a-6788-3e589ca290a2.htm

---

| Curve Overlap Point Class |
| --- |

A point of overlap of two curves and its type of overlap. Inheritance Hierarchy System Object
Autodesk.Revit.DB CurveOverlapPoint

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class CurveOverlapPoint : IDisposable
```

```
Public Class CurveOverlapPoint
	Implements IDisposable
```

```
public ref class CurveOverlapPoint : IDisposable
```

```
type CurveOverlapPoint =
    class
        interface IDisposable
    end
```
The CurveOverlapPoint type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | FirstParameter | The point's unnormalized parameter on the first curve. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Point | The 3D coordinate of the point. |
|  | SecondParameter | The point's unnormalized parameter on the second curve. |
|  | Type | The type of overlap at the point. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveOverlapPoint |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace